diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктовВФоне/ВКМ_МассовоеСозданиеАктовВФоне.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктовВФоне</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СозданныеДокументы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктовВФоне/ManagerModule.bsl
&НаСервере
Функция ЗаполнитьНаСервере(Параметры, АдресРезультата) Экспорт 
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ПОМЕСТИТЬ втДоговоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И &ДатаДоговора МЕЖДУ ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Договор.Ссылка КАК Реализации
	|ПОМЕСТИТЬ втРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
	|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДоговоры.Договор.Ссылка КАК ДоговорСсылка
	|ИЗ
	|	втДоговоры КАК втДоговоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ втРеализации КАК втРеализации
	|		ПО (втРеализации.Реализации.Ссылка = втДоговоры.Договор.Ссылка)
	|ГДЕ
	|	втРеализации.Реализации.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Параметры.КонецПериода);
	Запрос.УстановитьПараметр("ДатаДоговора", Параметры.ДатаДоговора);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	МассивДокументов = Новый Массив;
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		СписокДокументов = Новый Структура;
		
		НоваяРеализация = СозданиеРеализации(РезультатЗапроса.ДоговорСсылка,Параметры.КонецПериода);
		СписокДокументов.Вставить("Договор",РезультатЗапроса.ДоговорСсылка);
		СписокДокументов.Вставить("Реализация", НоваяРеализация);
		
		МассивДокументов.Добавить(СписокДокументов);
				
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(МассивДокументов, АдресРезультата);
	Возврат МассивДокументов;
	
КонецФункции

&НаСервере
Функция СозданиеРеализации(Договор, КонецПериода)
		
	НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДокумент.Контрагент = Договор.Владелец;
	НовыйДокумент.Договор = Договор;
	НовыйДокумент.Организация = Договор.Организация;
	НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	НовыйДокумент.Дата = КонецПериода;
	НовыйДокумент.ВыполнитьАвтозаполнение();
	
	Если ЗначениеЗаполнено(НовыйДокумент.Услуги) Тогда 
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		Возврат НовыйДокумент.Ссылка;
			
	КонецЕсли;
		
КонецФункции
